app/views/index/home.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
              <h5 class="card-title"><%= gossip.title %></h5>
              <h6 class="card-subtitle mb-2 text-muted"><%= link_to gossip.user.first_name + ' ' + gossip.user.last_name, user_path(gossip.user.id) %></h6>