app/views/users/show.html.erb


    <% @user.gossips.each do |gossip| %>
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."user_id" = $1  [["user_id", 1]]