app/views/gossips/edit.html.erb

      <p><%= @updated_gossip.content %></p>
    <footer class="blockquote-footer"><%= link_to @updated_gossip.user.first_name + ' ' + @updated_gossip.user.last_name, user_path(@updated_gossip.user.id) %>, from <i><%= link_to @updated_gossip.user.city.name, city_path(@updated_gossip.user.city.id) %></i></footer>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]


      <input type="hidden" name="user_id" value=<%= User.find_by(first_name: 'anonymous').id %> >
---
SELECT  "users".* FROM "users" WHERE "users"."first_name" = $1 LIMIT $2  [["first_name", "anonymous"], ["LIMIT", 1]]