app/views/gossips/new.html.erb


      <input type="hidden" name="user_id" value=<%= User.find_by(first_name: 'anonymous').id %> >
---
SELECT  "users".* FROM "users" WHERE "users"."first_name" = $1 LIMIT $2  [["first_name", "anonymous"], ["LIMIT", 1]]