app/views/gossips/show.html.erb

      <p><%= @gossip.content %></p>
    <footer class="blockquote-footer"><%= link_to @gossip.user.first_name + ' ' + @gossip.user.last_name, user_path(@gossip.user.id) %>, from <i><%= link_to @gossip.user.city.name, city_path(@gossip.user.city.id) %></i></footer>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]


      <% @gossip.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 8]]


      <input type="hidden" name="author_id" value=<%= User.find_by(first_name: 'anonymous').id %> >
---
SELECT  "users".* FROM "users" WHERE "users"."first_name" = $1 LIMIT $2  [["first_name", "anonymous"], ["LIMIT", 1]]