app/controllers/comments_controller.rb

    def create
      @comment = Comment.new(
        author_id: current_user.id,
        gossip_id: params[:gossip_id],
        content: params[:content]
      )

      if @comment.save
---
INSERT INTO "comments" ("author_id", "gossip_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 15], ["gossip_id", 11], ["content", "BIM"], ["created_at", "2019-05-02 19:23:11.895819"], ["updated_at", "2019-05-02 19:23:11.895819"]]