app/controllers/gossip_controller.rb

  def get_id
    @gossip = Gossip.all[(params[:id]).to_i]
---
SELECT "gossips".* FROM "gossips"