app/controllers/gossips_controller.rb

  def show
    @gossip = Gossip.all[(params[:id]).to_i]
---
SELECT "gossips".* FROM "gossips"