app/controllers/gossips_controller.rb

  def show
    @gossip = Gossip.find(params[:id])
    @comments = Comment.find_by(gossip_id: params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1 LIMIT $2  [["gossip_id", 11], ["LIMIT", 1]]

  def create
    @gossip = Gossip.new(
      title:   params[:title],
      content: params[:content],
      user_id: params[:user_id])

    if @gossip.save
---
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "azeazeaze"], ["content", "azeazeazeaze"], ["user_id", 9], ["created_at", "2019-04-30 16:31:50.446090"], ["updated_at", "2019-04-30 16:31:50.446090"]]

  def edit
    @updated_gossip = Gossip.find(params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def update
    @updated_gossip = Gossip.find(params[:id])
    if @updated_gossip.update(
        title: params[:title],
        content: params[:content],
        user_id: User.find_by(first_name: 'anonymous').id
      )
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "content" = $2, "user_id" = $3, "updated_at" = $4 WHERE "gossips"."id" = $5  [["title", "oijzoerjzeorjzoerj"], ["content", "zoeirjzeorjzoerijzeorjizeiorj"], ["user_id", 11], ["updated_at", "2019-05-02 14:18:30.287080"], ["id", 8]]
SELECT  "users".* FROM "users" WHERE "users"."first_name" = $1 LIMIT $2  [["first_name", "anonymous"], ["LIMIT", 1]]