app/controllers/index_controller.rb

  def home
    @gossips = Gossip.all
---
SELECT "gossips".* FROM "gossips"