app/controllers/users_controller.rb

INSERT INTO "cities" ("name", "zip_code", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Gre"], ["zip_code", "19692"], ["created_at", "2019-05-02 17:20:11.178668"], ["updated_at", "2019-05-02 17:20:11.178668"]]
INSERT INTO "users" ("first_name", "last_name", "description", "email", "age", "created_at", "updated_at", "city_id", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT  "cities".* FROM "cities" WHERE "cities"."name" = $1 LIMIT $2  [["name", "Gre"], ["LIMIT", 1]]
---
  def create
    city_exist?
    User.create!(
      first_name:            params[:first_name],
      last_name:             params[:last_name],
      description:           params[:description],
      email:                 params[:email],
      age:                   params[:age],
      city_id:               City.find_by(name: params[:city]).id,
      password:              params[:password],
      password_confirmation: params[:password_confirmation]
    )

SELECT  "cities".* FROM "cities" WHERE "cities"."name" = $1 LIMIT $2  [["name", "Gre"], ["LIMIT", 1]]
INSERT INTO "cities" ("name", "zip_code", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Dijon"], ["zip_code", "91331-1846"], ["created_at", "2019-05-02 17:33:41.983026"], ["updated_at", "2019-05-02 17:33:41.983026"]]
---
  def city_exist?
    if City.find_by(name: params[:city]).nil?
      City.create!(
        name:     params[:city],
        zip_code: Faker::Address.zip_code
      )
      return true
    else
      City.find_by(name: params[:city]).id