app/views/cities/show.html.erb


      <% @city.gossips.each do |gossip| %>
---
SELECT "gossips".* FROM "gossips" INNER JOIN "users" ON "gossips"."user_id" = "users"."id" WHERE "users"."city_id" = $1  [["city_id", 1]]

              <h5 class="card-title"><%= gossip.title %></h5>
              <h6 class="card-subtitle mb-2 text-muted"><%= link_to gossip.user.first_name + ' ' + gossip.user.last_name, user_path(gossip.user.id) %></h6>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]